; domain
; This program has been derived and modified from the tool-kit at: 
; https://code.google.com/p/rip-planning-group/source/browse/trunk/project1/sokoban-domain.pddl?r=222 
; See LICENSE file at http://opensource.org/licenses/BSD-3-Clause for the New BSD license

(define (domain sokoban)

(:requirements :strips)

(:predicates 
		
		;Accessible location in Workspace
		(navigable ?l)
		
		;Direction of Movement
		(direction ?d)
		
		;Current location of the Block
		(block-at ?b ?l)
		
		;Current location of the Robot
		(robot-at ?l)
		
		;Selected Block
		(block ?b)
		
		;Location l1 and l2 are next to each other along the direction of Movement
		(adjacent ?l1 ?l2 ?d) 
		
		;Empty location in workspace
		(empty ?l)
	)

(:action move
	
	;Define Move Action
	;Requires from location, to location and direction of move
	;Requires from and to locations to be within workspace
	
	:parameters (?from ?to ?dirMove)
	
	:precondition (and
		
		(navigable ?from) 
		(navigable ?to) 
		(direction ?dirMove) 
		
		;Current location of the Robot as from location
		(robot-at ?from) 
		
		;Requires from and to locations to be next to each other along the direction of Movement
		(adjacent ?from ?to ?dirMove)
		
		;Requires to locations to be empty location in workspace 
		(empty ?to)
		
		)
	
	:effect (and 
		
		;Sets from locations to be empty location in workspace
		(empty ?from)
		
		;Sets Current location of the Robot as the to location in workspace
		(robot-at ?to) 
		
		;Updates to locations as not null, and sets from location as not the current location of the Robot in workspace
		(not (empty ?to))
		(not (robot-at ?from))
		)
	)

(:action push
	
	;Defines parameters for push operation that include robot location, selected block and its location
	;empty location to which the block has to be moved and the direction of the push operation
	
	:parameters (?robotLoc ?blockLoc ?freeLoc ?dirPush ?activeBlock)
	
	:precondition (and 
		
		;Requires robot location, selected block location and the empty location to be open in the workspace
		(navigable ?robotLoc) 
		(navigable ?blockLoc) 
		(navigable ?freeLoc) 
		
		;Initializing input variables
		(direction ?dirPush) 
		(block ?activeBlock) 
		(robot-at ?robotLoc) 
		
		;Initializing resultant variables
		(block-at ?activeBlock ?blockLoc) 
		(adjacent ?robotLoc ?blockLoc ?dirPush) 
		(adjacent ?blockLoc ?freeLoc ?dirPush) 
		(empty ?freeLoc)
		)
	
	:effect (and 
			
		;Sets robots new current location as the selected blocks old location
		(robot-at ?blockLoc)
		
		;Sets selected blocks new current location as the old null location 
		(block-at ?activeBlock ?freeLoc) 
		
		;Sets robots old location as null location
		(empty ?robotLoc) 
		
		;Updates the different locations as per effect of the move
		(not (robot-at ?robotLoc)) 
		(not (block-at ?activeBlock ?blockLoc)) 
		(not (empty ?freeLoc))
		)
	)

)

; problem
; This program has been derived and modified from the tool-kit at: 
; https://code.google.com/p/rip-planning-group/source/browse/trunk/project1/sokoban-domain.pddl?r=222 
; See LICENSE file at http://opensource.org/licenses/BSD-3-Clause for the New BSD license

(define (problem sokoban3)
	
	(:domain sokoban)
	
	(:objects 
		
		;Performs the following steps
		;Define valid directions
		;Define blocks in the problem world
		;Define the problem world co-ordinates

		up down left right 
		
		blockA blockB blockC
		
		X01-A X01-B X01-C X01-D X01-E X01-F X01-G X01-H
		X02-A X02-B X02-C X02-D X02-E X02-F X02-G X02-H
		X03-A X03-B X03-C X03-D X03-E X03-F X03-G X03-H
		X04-A X04-B X04-C X04-D X04-E X04-F X04-G X04-H
		X05-A X05-B X05-C X05-D X05-E X05-F X05-G X05-H
		X06-A X06-B X06-C X06-D X06-E X06-F X06-G X06-H 
		X07-A X07-B X07-C X07-D X07-E X07-F X07-G X07-H
		X08-A X08-B X08-C X08-D X08-E X08-F X08-G X08-H
		X09-A X09-B X09-C X09-D X09-E X09-F X09-G X09-H
		X10-A X10-B X10-C X10-D X10-E X10-F X10-G X10-H
		X11-A X11-B X11-C X11-D X11-E X11-F X11-G X11-H
		
	)

	(:init
	
		;Performs the following steps
		;Initialize different directions for use in domain
		;Initialize different blocks for use in domain
		;Initialize different open locations in the workspace for use in domain
		;Initialize different empty locations in the workspace for use in domain
		;Initialize the current location of the robot in the workspace for use in domain
		;Initialize the current location of the blocks in the workspace for use in domain
		;Initialize the adjacency matrix for the different cells in the workspace for use in domain

		(direction up)
		(direction down)
		(direction left) 
		(direction right)
		
		(block blockA)
		(block blockB)
		(block blockC)

		(navigable X08-G)
		(navigable X09-G)
		(navigable X10-G)
		(navigable X08-F)
		(navigable X10-F)
		(navigable X08-E)
		(navigable X10-E)
		(navigable X02-D)
		(navigable X03-D)
		(navigable X04-D)
		(navigable X05-D)
		(navigable X06-D)
		(navigable X07-D)
		(navigable X08-D)
		(navigable X09-D)
		(navigable X10-D)
		(navigable X02-C)
		(navigable X04-C)
		(navigable X06-C)
		(navigable X08-C)
		(navigable X02-B)
		(navigable X03-B)
		(navigable X04-B)
		(navigable X05-B)
		(navigable X06-B)
		(navigable X07-B)
		(navigable X08-B)
		
		(empty X08-G)
		(empty X09-G)
		(empty X10-G)
		(empty X08-F)
		(empty X10-F)
		(empty X08-E)
		(empty X10-E)
		(empty X02-D)
		(empty X04-D)
		(empty X06-D)
		(empty X08-D)
		(empty X10-D)
		(empty X02-C)
		(empty X04-C)
		(empty X06-C)
		(empty X08-C)
		(empty X02-B)
		(empty X03-B)
		(empty X04-B)
		(empty X05-B)
		(empty X06-B)
		(empty X07-B)
		(empty X08-B)
  
		(robot-at X03-D)
		
		(block-at blockA X09-D)
		(block-at blockB X07-D)
		(block-at blockC X05-D)

		(adjacent X01-A X02-A right) (adjacent X01-A X01-B up)
		(adjacent X01-B X02-B right) (adjacent X01-B X01-A down) (adjacent X01-B X01-C up)
		(adjacent X01-C X02-C right) (adjacent X01-C X01-B down) (adjacent X01-C X01-D up)
		(adjacent X01-D X02-D right) (adjacent X01-D X01-C down) (adjacent X01-D X01-E up)
		(adjacent X01-E X02-E right) (adjacent X01-E X01-D down) (adjacent X01-E X01-F up)
		(adjacent X01-F X02-F right) (adjacent X01-F X01-E down) (adjacent X01-F X01-G up)
		(adjacent X01-G X02-G right) (adjacent X01-G X01-F down) (adjacent X01-G X01-H up)
		(adjacent X01-H X02-H right) (adjacent X01-H X01-G down)

		(adjacent X02-A X01-A left) (adjacent X02-A X03-A right) (adjacent X02-A X02-B up)
		(adjacent X02-B X01-B left) (adjacent X02-B X03-B right) (adjacent X02-B X02-A down) (adjacent X02-B X02-C up)
		(adjacent X02-C X01-C left) (adjacent X02-C X03-C right) (adjacent X02-C X02-B down) (adjacent X02-C X02-D up)
		(adjacent X02-D X01-D left) (adjacent X02-D X03-D right) (adjacent X02-D X02-C down) (adjacent X02-D X02-E up)
		(adjacent X02-E X01-E left) (adjacent X02-E X03-E right) (adjacent X02-E X02-D down) (adjacent X02-E X02-F up)
		(adjacent X02-F X01-F left) (adjacent X02-F X03-F right) (adjacent X02-F X02-E down) (adjacent X02-F X02-G up)
		(adjacent X02-G X01-G left) (adjacent X02-G X03-G right) (adjacent X02-G X02-F down) (adjacent X02-G X02-H up)
		(adjacent X02-H X01-H left) (adjacent X02-H X03-H right) (adjacent X02-H X02-G down)

		(adjacent X03-A X02-A left) (adjacent X03-A X04-A right) (adjacent X03-A X03-B up)
		(adjacent X03-B X02-B left) (adjacent X03-B X04-B right) (adjacent X03-B X03-A down) (adjacent X03-B X03-C up)
		(adjacent X03-C X02-C left) (adjacent X03-C X04-C right) (adjacent X03-C X03-B down) (adjacent X03-C X03-D up)
		(adjacent X03-D X02-D left) (adjacent X03-D X04-D right) (adjacent X03-D X03-C down) (adjacent X03-D X03-E up)
		(adjacent X03-E X02-E left) (adjacent X03-E X04-E right) (adjacent X03-E X03-D down) (adjacent X03-E X03-F up)
		(adjacent X03-F X02-F left) (adjacent X03-F X04-F right) (adjacent X03-F X03-E down) (adjacent X03-F X03-G up)
		(adjacent X03-G X02-G left) (adjacent X03-G X04-G right) (adjacent X03-G X03-F down) (adjacent X03-G X03-H up)
		(adjacent X03-H X02-H left) (adjacent X03-H X04-H right) (adjacent X03-H X03-G down)

		(adjacent X04-A X03-A left) (adjacent X04-A X05-A right) (adjacent X04-A X04-B up)
		(adjacent X04-B X03-B left) (adjacent X04-B X05-B right) (adjacent X04-B X04-A down) (adjacent X04-B X04-C up)
		(adjacent X04-C X03-C left) (adjacent X04-C X05-C right) (adjacent X04-C X04-B down) (adjacent X04-C X04-D up)
		(adjacent X04-D X03-D left) (adjacent X04-D X05-D right) (adjacent X04-D X04-C down) (adjacent X04-D X04-E up)
		(adjacent X04-E X03-E left) (adjacent X04-E X05-E right) (adjacent X04-E X04-D down) (adjacent X04-E X04-F up)
		(adjacent X04-F X03-F left) (adjacent X04-F X05-F right) (adjacent X04-F X04-E down) (adjacent X04-F X04-G up)
		(adjacent X04-G X03-G left) (adjacent X04-G X05-G right) (adjacent X04-G X04-F down) (adjacent X04-G X04-H up)
		(adjacent X04-H X03-H left) (adjacent X04-H X05-H right) (adjacent X04-H X04-G down)

		(adjacent X05-A X04-A left) (adjacent X05-A X06-A right) (adjacent X05-A X05-B up)
		(adjacent X05-B X04-B left) (adjacent X05-B X06-B right) (adjacent X05-B X05-A down) (adjacent X05-B X05-C up)
		(adjacent X05-C X04-C left) (adjacent X05-C X06-C right) (adjacent X05-C X05-B down) (adjacent X05-C X05-D up)
		(adjacent X05-D X04-D left) (adjacent X05-D X06-D right) (adjacent X05-D X05-C down) (adjacent X05-D X05-E up)
		(adjacent X05-E X04-E left) (adjacent X05-E X06-E right) (adjacent X05-E X05-D down) (adjacent X05-E X05-F up)
		(adjacent X05-F X04-F left) (adjacent X05-F X06-F right) (adjacent X05-F X05-E down) (adjacent X05-F X05-G up)
		(adjacent X05-G X04-G left) (adjacent X05-G X06-G right) (adjacent X05-G X05-F down) (adjacent X05-G X05-H up)
		(adjacent X05-H X04-H left) (adjacent X05-H X06-H right) (adjacent X05-H X05-G down)

		(adjacent X06-A X05-A left) (adjacent X06-A X07-A right) (adjacent X06-A X06-B up)
		(adjacent X06-B X05-B left) (adjacent X06-B X07-B right) (adjacent X06-B X06-A down) (adjacent X06-B X06-C up)
		(adjacent X06-C X05-C left) (adjacent X06-C X07-C right) (adjacent X06-C X06-B down) (adjacent X06-C X06-D up)
		(adjacent X06-D X05-D left) (adjacent X06-D X07-D right) (adjacent X06-D X06-C down) (adjacent X06-D X06-E up)
		(adjacent X06-E X05-E left) (adjacent X06-E X07-E right) (adjacent X06-E X06-D down) (adjacent X06-E X06-F up)
		(adjacent X06-F X05-F left) (adjacent X06-F X07-F right) (adjacent X06-F X06-E down) (adjacent X06-F X06-G up)
		(adjacent X06-G X05-G left) (adjacent X06-G X07-G right) (adjacent X06-G X06-F down) (adjacent X06-G X06-H up)
		(adjacent X06-H X05-H left) (adjacent X06-H X07-H right) (adjacent X06-H X06-G down)


		(adjacent X07-A X06-A left) (adjacent X07-A X08-A right) (adjacent X07-A X07-B up)
		(adjacent X07-B X06-B left) (adjacent X07-B X08-B right) (adjacent X07-B X07-A down) (adjacent X07-B X07-C up)
		(adjacent X07-C X06-C left) (adjacent X07-C X08-C right) (adjacent X07-C X07-B down) (adjacent X07-C X07-D up)
		(adjacent X07-D X06-D left) (adjacent X07-D X08-D right) (adjacent X07-D X07-C down) (adjacent X07-D X07-E up)
		(adjacent X07-E X06-E left) (adjacent X07-E X08-E right) (adjacent X07-E X07-D down) (adjacent X07-E X07-F up)
		(adjacent X07-F X06-F left) (adjacent X07-F X08-F right) (adjacent X07-F X07-E down) (adjacent X07-F X07-G up)
		(adjacent X07-G X06-G left) (adjacent X07-G X08-G right) (adjacent X07-G X07-F down) (adjacent X07-G X07-H up)
		(adjacent X07-H X06-H left) (adjacent X07-H X08-H right) (adjacent X07-H X07-G down)

		(adjacent X08-A X07-A left) (adjacent X08-A X09-A right) (adjacent X08-A X08-B up)
		(adjacent X08-B X07-B left) (adjacent X08-B X09-B right) (adjacent X08-B X08-A down) (adjacent X08-B X08-C up)
		(adjacent X08-C X07-C left) (adjacent X08-C X09-C right) (adjacent X08-C X08-B down) (adjacent X08-C X08-D up)
		(adjacent X08-D X07-D left) (adjacent X08-D X09-D right) (adjacent X08-D X08-C down) (adjacent X08-D X08-E up)
		(adjacent X08-E X07-E left) (adjacent X08-E X09-E right) (adjacent X08-E X08-D down) (adjacent X08-E X08-F up)
		(adjacent X08-F X07-F left) (adjacent X08-F X09-F right) (adjacent X08-F X08-E down) (adjacent X08-F X08-G up)
		(adjacent X08-G X07-G left) (adjacent X08-G X09-G right) (adjacent X08-G X08-F down) (adjacent X08-G X08-H up)
		(adjacent X08-H X07-H left) (adjacent X08-H X09-H right) (adjacent X08-H X08-G down)

		(adjacent X09-A X08-A left) (adjacent X09-A X10-A right) (adjacent X09-A X09-B up)
		(adjacent X09-B X08-B left) (adjacent X09-B X10-B right) (adjacent X09-B X09-A down) (adjacent X09-B X09-C up)
		(adjacent X09-C X08-C left) (adjacent X09-C X10-C right) (adjacent X09-C X09-B down) (adjacent X09-C X09-D up)
		(adjacent X09-D X08-D left) (adjacent X09-D X10-D right) (adjacent X09-D X09-C down) (adjacent X09-D X09-E up)
		(adjacent X09-E X08-E left) (adjacent X09-E X10-E right) (adjacent X09-E X09-D down) (adjacent X09-E X09-F up)
		(adjacent X09-F X08-F left) (adjacent X09-F X10-F right) (adjacent X09-F X09-E down) (adjacent X09-F X09-G up)
		(adjacent X09-G X08-G left) (adjacent X09-G X10-G right) (adjacent X09-G X09-F down) (adjacent X09-G X09-H up)
		(adjacent X09-H X08-H left) (adjacent X09-H X10-H right) (adjacent X09-H X09-G down)

		(adjacent X10-A X09-A left) (adjacent X10-A X11-A right) (adjacent X10-A X10-B up)
		(adjacent X10-B X09-B left) (adjacent X10-B X11-B right) (adjacent X10-B X10-A down) (adjacent X10-B X10-C up)
		(adjacent X10-C X09-C left) (adjacent X10-C X11-C right) (adjacent X10-C X10-B down) (adjacent X10-C X10-D up)
		(adjacent X10-D X09-D left) (adjacent X10-D X11-D right) (adjacent X10-D X10-C down) (adjacent X10-D X10-E up)
		(adjacent X10-E X09-E left) (adjacent X10-E X11-E right) (adjacent X10-E X10-D down) (adjacent X10-E X10-F up)
		(adjacent X10-F X09-F left) (adjacent X10-F X11-F right) (adjacent X10-F X10-E down) (adjacent X10-F X10-G up)
		(adjacent X10-G X09-G left) (adjacent X10-G X11-G right) (adjacent X10-G X10-F down) (adjacent X10-G X10-H up)
		(adjacent X10-H X09-H left) (adjacent X10-H X11-H right) (adjacent X10-H X10-G down)

		(adjacent X11-A X10-A left) (adjacent X11-A X11-B up)
		(adjacent X11-B X10-B left) (adjacent X11-B X11-A down) (adjacent X11-B X11-C up)
		(adjacent X11-C X10-C left) (adjacent X11-C X11-B down) (adjacent X11-C X11-D up)
		(adjacent X11-D X10-D left) (adjacent X11-D X11-C down) (adjacent X11-D X11-E up)
		(adjacent X11-E X10-E left) (adjacent X11-E X11-D down) (adjacent X11-E X11-F up)
		(adjacent X11-F X10-F left) (adjacent X11-F X11-E down) (adjacent X11-F X11-G up)
		(adjacent X11-G X10-G left) (adjacent X11-G X11-F down) (adjacent X11-G X11-H up)
		(adjacent X11-H X10-H left) (adjacent X11-H X11-G down)

	)

	(:goal
		
		;Performs the following steps
		;Define the final location of the blocks in the workspace as goal for the planners
		
		(and (block-at blockA X08-G) (block-at blockB X08-F) (block-at blockC X08-E))
	
	)

)

; plan
1. (move x03-d x04-d right)
   deleted: (empty x04-d) (robot-at x03-d)
   added: (empty x03-d) (robot-at x04-d)
   goals met: 0 of 3
2. (move x04-d x04-c down)
   deleted: (empty x04-c) (robot-at x04-d)
   added: (empty x04-d) (robot-at x04-c)
   goals met: 0 of 3
3. (move x04-c x04-b down)
   deleted: (empty x04-b) (robot-at x04-c)
   added: (empty x04-c) (robot-at x04-b)
   goals met: 0 of 3
4. (move x04-b x05-b right)
   deleted: (empty x05-b) (robot-at x04-b)
   added: (empty x04-b) (robot-at x05-b)
   goals met: 0 of 3
5. (move x05-b x06-b right)
   deleted: (empty x06-b) (robot-at x05-b)
   added: (empty x05-b) (robot-at x06-b)
   goals met: 0 of 3
6. (move x06-b x06-c up)
   deleted: (empty x06-c) (robot-at x06-b)
   added: (empty x06-b) (robot-at x06-c)
   goals met: 0 of 3
7. (move x06-c x06-d up)
   deleted: (empty x06-d) (robot-at x06-c)
   added: (empty x06-c) (robot-at x06-d)
   goals met: 0 of 3
8. (push x06-d x05-d x04-d left blockc)
   deleted: (robot-at x06-d) (block-at blockc x05-d) (empty x04-d)
   added: (robot-at x05-d) (block-at blockc x04-d) (empty x06-d)
   goals met: 0 of 3
9. (push x05-d x04-d x03-d left blockc)
   deleted: (robot-at x05-d) (block-at blockc x04-d) (empty x03-d)
   added: (robot-at x04-d) (block-at blockc x03-d) (empty x05-d)
   goals met: 0 of 3
10. (move x04-d x05-d right)
   deleted: (empty x05-d) (robot-at x04-d)
   added: (empty x04-d) (robot-at x05-d)
   goals met: 0 of 3
11. (move x05-d x06-d right)
   deleted: (empty x06-d) (robot-at x05-d)
   added: (empty x05-d) (robot-at x06-d)
   goals met: 0 of 3
12. (move x06-d x06-c down)
   deleted: (empty x06-c) (robot-at x06-d)
   added: (empty x06-d) (robot-at x06-c)
   goals met: 0 of 3
13. (move x06-c x06-b down)
   deleted: (empty x06-b) (robot-at x06-c)
   added: (empty x06-c) (robot-at x06-b)
   goals met: 0 of 3
14. (move x06-b x07-b right)
   deleted: (empty x07-b) (robot-at x06-b)
   added: (empty x06-b) (robot-at x07-b)
   goals met: 0 of 3
15. (move x07-b x08-b right)
   deleted: (empty x08-b) (robot-at x07-b)
   added: (empty x07-b) (robot-at x08-b)
   goals met: 0 of 3
16. (move x08-b x08-c up)
   deleted: (empty x08-c) (robot-at x08-b)
   added: (empty x08-b) (robot-at x08-c)
   goals met: 0 of 3
17. (move x08-c x08-d up)
   deleted: (empty x08-d) (robot-at x08-c)
   added: (empty x08-c) (robot-at x08-d)
   goals met: 0 of 3
18. (move x08-d x08-e up)
   deleted: (empty x08-e) (robot-at x08-d)
   added: (empty x08-d) (robot-at x08-e)
   goals met: 0 of 3
19. (move x08-e x08-f up)
   deleted: (empty x08-f) (robot-at x08-e)
   added: (empty x08-e) (robot-at x08-f)
   goals met: 0 of 3
20. (move x08-f x08-g up)
   deleted: (empty x08-g) (robot-at x08-f)
   added: (empty x08-f) (robot-at x08-g)
   goals met: 0 of 3
21. (move x08-g x09-g right)
   deleted: (empty x09-g) (robot-at x08-g)
   added: (empty x08-g) (robot-at x09-g)
   goals met: 0 of 3
22. (move x09-g x10-g right)
   deleted: (empty x10-g) (robot-at x09-g)
   added: (empty x09-g) (robot-at x10-g)
   goals met: 0 of 3
23. (move x10-g x10-f down)
   deleted: (empty x10-f) (robot-at x10-g)
   added: (empty x10-g) (robot-at x10-f)
   goals met: 0 of 3
24. (move x10-f x10-e down)
   deleted: (empty x10-e) (robot-at x10-f)
   added: (empty x10-f) (robot-at x10-e)
   goals met: 0 of 3
25. (move x10-e x10-d down)
   deleted: (empty x10-d) (robot-at x10-e)
   added: (empty x10-e) (robot-at x10-d)
   goals met: 0 of 3
26. (push x10-d x09-d x08-d left blocka)
   deleted: (robot-at x10-d) (block-at blocka x09-d) (empty x08-d)
   added: (robot-at x09-d) (block-at blocka x08-d) (empty x10-d)
   goals met: 0 of 3
27. (move x09-d x10-d right)
   deleted: (empty x10-d) (robot-at x09-d)
   added: (empty x09-d) (robot-at x10-d)
   goals met: 0 of 3
28. (move x10-d x10-e up)
   deleted: (empty x10-e) (robot-at x10-d)
   added: (empty x10-d) (robot-at x10-e)
   goals met: 0 of 3
29. (move x10-e x10-f up)
   deleted: (empty x10-f) (robot-at x10-e)
   added: (empty x10-e) (robot-at x10-f)
   goals met: 0 of 3
30. (move x10-f x10-g up)
   deleted: (empty x10-g) (robot-at x10-f)
   added: (empty x10-f) (robot-at x10-g)
   goals met: 0 of 3
31. (move x10-g x09-g left)
   deleted: (empty x09-g) (robot-at x10-g)
   added: (empty x10-g) (robot-at x09-g)
   goals met: 0 of 3
32. (move x09-g x08-g left)
   deleted: (empty x08-g) (robot-at x09-g)
   added: (empty x09-g) (robot-at x08-g)
   goals met: 0 of 3
33. (move x08-g x08-f down)
   deleted: (empty x08-f) (robot-at x08-g)
   added: (empty x08-g) (robot-at x08-f)
   goals met: 0 of 3
34. (move x08-f x08-e down)
   deleted: (empty x08-e) (robot-at x08-f)
   added: (empty x08-f) (robot-at x08-e)
   goals met: 0 of 3
35. (push x08-e x08-d x08-c down blocka)
   deleted: (robot-at x08-e) (block-at blocka x08-d) (empty x08-c)
   added: (robot-at x08-d) (block-at blocka x08-c) (empty x08-e)
   goals met: 0 of 3
36. (push x08-d x07-d x06-d left blockb)
   deleted: (robot-at x08-d) (block-at blockb x07-d) (empty x06-d)
   added: (robot-at x07-d) (block-at blockb x06-d) (empty x08-d)
   goals met: 0 of 3
37. (push x07-d x06-d x05-d left blockb)
   deleted: (robot-at x07-d) (block-at blockb x06-d) (empty x05-d)
   added: (robot-at x06-d) (block-at blockb x05-d) (empty x07-d)
   goals met: 0 of 3
38. (move x06-d x06-c down)
   deleted: (empty x06-c) (robot-at x06-d)
   added: (empty x06-d) (robot-at x06-c)
   goals met: 0 of 3
39. (move x06-c x06-b down)
   deleted: (empty x06-b) (robot-at x06-c)
   added: (empty x06-c) (robot-at x06-b)
   goals met: 0 of 3
40. (move x06-b x07-b right)
   deleted: (empty x07-b) (robot-at x06-b)
   added: (empty x06-b) (robot-at x07-b)
   goals met: 0 of 3
41. (move x07-b x08-b right)
   deleted: (empty x08-b) (robot-at x07-b)
   added: (empty x07-b) (robot-at x08-b)
   goals met: 0 of 3
42. (push x08-b x08-c x08-d up blocka)
   deleted: (robot-at x08-b) (block-at blocka x08-c) (empty x08-d)
   added: (robot-at x08-c) (block-at blocka x08-d) (empty x08-b)
   goals met: 0 of 3
43. (push x08-c x08-d x08-e up blocka)
   deleted: (robot-at x08-c) (block-at blocka x08-d) (empty x08-e)
   added: (robot-at x08-d) (block-at blocka x08-e) (empty x08-c)
   goals met: 0 of 3
44. (push x08-d x08-e x08-f up blocka)
   deleted: (robot-at x08-d) (block-at blocka x08-e) (empty x08-f)
   added: (robot-at x08-e) (block-at blocka x08-f) (empty x08-d)
   goals met: 0 of 3
45. (push x08-e x08-f x08-g up blocka)
   deleted: (robot-at x08-e) (block-at blocka x08-f) (empty x08-g)
   added: (robot-at x08-f) (block-at blocka x08-g) (empty x08-e)
   goals met: 1 of 3
46. (move x08-f x08-e down)
   deleted: (empty x08-e) (robot-at x08-f)
   added: (empty x08-f) (robot-at x08-e)
   goals met: 1 of 3
47. (move x08-e x08-d down)
   deleted: (empty x08-d) (robot-at x08-e)
   added: (empty x08-e) (robot-at x08-d)
   goals met: 1 of 3
48. (move x08-d x08-c down)
   deleted: (empty x08-c) (robot-at x08-d)
   added: (empty x08-d) (robot-at x08-c)
   goals met: 1 of 3
49. (move x08-c x08-b down)
   deleted: (empty x08-b) (robot-at x08-c)
   added: (empty x08-c) (robot-at x08-b)
   goals met: 1 of 3
50. (move x08-b x07-b left)
   deleted: (empty x07-b) (robot-at x08-b)
   added: (empty x08-b) (robot-at x07-b)
   goals met: 1 of 3
51. (move x07-b x06-b left)
   deleted: (empty x06-b) (robot-at x07-b)
   added: (empty x07-b) (robot-at x06-b)
   goals met: 1 of 3
52. (move x06-b x05-b left)
   deleted: (empty x05-b) (robot-at x06-b)
   added: (empty x06-b) (robot-at x05-b)
   goals met: 1 of 3
53. (move x05-b x04-b left)
   deleted: (empty x04-b) (robot-at x05-b)
   added: (empty x05-b) (robot-at x04-b)
   goals met: 1 of 3
54. (move x04-b x04-c up)
   deleted: (empty x04-c) (robot-at x04-b)
   added: (empty x04-b) (robot-at x04-c)
   goals met: 1 of 3
55. (move x04-c x04-d up)
   deleted: (empty x04-d) (robot-at x04-c)
   added: (empty x04-c) (robot-at x04-d)
   goals met: 1 of 3
56. (push x04-d x05-d x06-d right blockb)
   deleted: (robot-at x04-d) (block-at blockb x05-d) (empty x06-d)
   added: (robot-at x05-d) (block-at blockb x06-d) (empty x04-d)
   goals met: 1 of 3
57. (push x05-d x06-d x07-d right blockb)
   deleted: (robot-at x05-d) (block-at blockb x06-d) (empty x07-d)
   added: (robot-at x06-d) (block-at blockb x07-d) (empty x05-d)
   goals met: 1 of 3
58. (push x06-d x07-d x08-d right blockb)
   deleted: (robot-at x06-d) (block-at blockb x07-d) (empty x08-d)
   added: (robot-at x07-d) (block-at blockb x08-d) (empty x06-d)
   goals met: 1 of 3
59. (move x07-d x06-d left)
   deleted: (empty x06-d) (robot-at x07-d)
   added: (empty x07-d) (robot-at x06-d)
   goals met: 1 of 3
60. (move x06-d x06-c down)
   deleted: (empty x06-c) (robot-at x06-d)
   added: (empty x06-d) (robot-at x06-c)
   goals met: 1 of 3
61. (move x06-c x06-b down)
   deleted: (empty x06-b) (robot-at x06-c)
   added: (empty x06-c) (robot-at x06-b)
   goals met: 1 of 3
62. (move x06-b x07-b right)
   deleted: (empty x07-b) (robot-at x06-b)
   added: (empty x06-b) (robot-at x07-b)
   goals met: 1 of 3
63. (move x07-b x08-b right)
   deleted: (empty x08-b) (robot-at x07-b)
   added: (empty x07-b) (robot-at x08-b)
   goals met: 1 of 3
64. (move x08-b x08-c up)
   deleted: (empty x08-c) (robot-at x08-b)
   added: (empty x08-b) (robot-at x08-c)
   goals met: 1 of 3
65. (push x08-c x08-d x08-e up blockb)
   deleted: (robot-at x08-c) (block-at blockb x08-d) (empty x08-e)
   added: (robot-at x08-d) (block-at blockb x08-e) (empty x08-c)
   goals met: 1 of 3
66. (push x08-d x08-e x08-f up blockb)
   deleted: (robot-at x08-d) (block-at blockb x08-e) (empty x08-f)
   added: (robot-at x08-e) (block-at blockb x08-f) (empty x08-d)
   goals met: 2 of 3
67. (move x08-e x08-d down)
   deleted: (empty x08-d) (robot-at x08-e)
   added: (empty x08-e) (robot-at x08-d)
   goals met: 2 of 3
68. (move x08-d x08-c down)
   deleted: (empty x08-c) (robot-at x08-d)
   added: (empty x08-d) (robot-at x08-c)
   goals met: 2 of 3
69. (move x08-c x08-b down)
   deleted: (empty x08-b) (robot-at x08-c)
   added: (empty x08-c) (robot-at x08-b)
   goals met: 2 of 3
70. (move x08-b x07-b left)
   deleted: (empty x07-b) (robot-at x08-b)
   added: (empty x08-b) (robot-at x07-b)
   goals met: 2 of 3
71. (move x07-b x06-b left)
   deleted: (empty x06-b) (robot-at x07-b)
   added: (empty x07-b) (robot-at x06-b)
   goals met: 2 of 3
72. (move x06-b x05-b left)
   deleted: (empty x05-b) (robot-at x06-b)
   added: (empty x06-b) (robot-at x05-b)
   goals met: 2 of 3
73. (move x05-b x04-b left)
   deleted: (empty x04-b) (robot-at x05-b)
   added: (empty x05-b) (robot-at x04-b)
   goals met: 2 of 3
74. (move x04-b x03-b left)
   deleted: (empty x03-b) (robot-at x04-b)
   added: (empty x04-b) (robot-at x03-b)
   goals met: 2 of 3
75. (move x03-b x02-b left)
   deleted: (empty x02-b) (robot-at x03-b)
   added: (empty x03-b) (robot-at x02-b)
   goals met: 2 of 3
76. (move x02-b x02-c up)
   deleted: (empty x02-c) (robot-at x02-b)
   added: (empty x02-b) (robot-at x02-c)
   goals met: 2 of 3
77. (move x02-c x02-d up)
   deleted: (empty x02-d) (robot-at x02-c)
   added: (empty x02-c) (robot-at x02-d)
   goals met: 2 of 3
78. (push x02-d x03-d x04-d right blockc)
   deleted: (robot-at x02-d) (block-at blockc x03-d) (empty x04-d)
   added: (robot-at x03-d) (block-at blockc x04-d) (empty x02-d)
   goals met: 2 of 3
79. (push x03-d x04-d x05-d right blockc)
   deleted: (robot-at x03-d) (block-at blockc x04-d) (empty x05-d)
   added: (robot-at x04-d) (block-at blockc x05-d) (empty x03-d)
   goals met: 2 of 3
80. (push x04-d x05-d x06-d right blockc)
   deleted: (robot-at x04-d) (block-at blockc x05-d) (empty x06-d)
   added: (robot-at x05-d) (block-at blockc x06-d) (empty x04-d)
   goals met: 2 of 3
81. (push x05-d x06-d x07-d right blockc)
   deleted: (robot-at x05-d) (block-at blockc x06-d) (empty x07-d)
   added: (robot-at x06-d) (block-at blockc x07-d) (empty x05-d)
   goals met: 2 of 3
82. (push x06-d x07-d x08-d right blockc)
   deleted: (robot-at x06-d) (block-at blockc x07-d) (empty x08-d)
   added: (robot-at x07-d) (block-at blockc x08-d) (empty x06-d)
   goals met: 2 of 3
83. (move x07-d x06-d left)
   deleted: (empty x06-d) (robot-at x07-d)
   added: (empty x07-d) (robot-at x06-d)
   goals met: 2 of 3
84. (move x06-d x06-c down)
   deleted: (empty x06-c) (robot-at x06-d)
   added: (empty x06-d) (robot-at x06-c)
   goals met: 2 of 3
85. (move x06-c x06-b down)
   deleted: (empty x06-b) (robot-at x06-c)
   added: (empty x06-c) (robot-at x06-b)
   goals met: 2 of 3
86. (move x06-b x07-b right)
   deleted: (empty x07-b) (robot-at x06-b)
   added: (empty x06-b) (robot-at x07-b)
   goals met: 2 of 3
87. (move x07-b x08-b right)
   deleted: (empty x08-b) (robot-at x07-b)
   added: (empty x07-b) (robot-at x08-b)
   goals met: 2 of 3
88. (move x08-b x08-c up)
   deleted: (empty x08-c) (robot-at x08-b)
   added: (empty x08-b) (robot-at x08-c)
   goals met: 2 of 3
89. (push x08-c x08-d x08-e up blockc)
   deleted: (robot-at x08-c) (block-at blockc x08-d) (empty x08-e)
   added: (robot-at x08-d) (block-at blockc x08-e) (empty x08-c)
   goals met: 3 of 3
